code/security-ws/output/ws-securitypolicy/username-timestamp-wrongpassword-request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security
                xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Timestamp wsu:Id="TS-4eb0652f-669e-400f-ae40-f44e2ef3600f">
                <wsu:Created>2016-04-11T10:38:32.102Z</wsu:Created>
                <wsu:Expires>2016-04-11T10:43:32.102Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-233d0d4e-f83d-4373-a9e3-78c1b769ae24">
                <wsse:Username>cmoulliard</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
                    ZVs50iQdO1SewXpPxSK+X7b3+Fs=
                </wsse:Password>
                <wsse:Nonce
                        EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
                    jAmbjUuIrLoDyTL4+b/5Iw==
                </wsse:Nonce>
                <wsu:Created>2016-04-11T10:38:32.119Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body>
        <greetMe xmlns="http://jboss.org/HelloWorld/types">
            <requestType>Charles</requestType>
        </greetMe>
    </soap:Body>
</soap:Envelope>
